import { test } from 'node:test';
import assert from 'node:assert/strict';;
import fn from './B.js';

test('1', () => {
  assert.strictEqual(fn(['2 0 1 1 0 1 0 2 1 2']), 3);

  // Примечания;
  // В примере из условия дальше всего идти до ближайшего магазина жителям четвертого дома: ближайший
  // к их дому магазин находится в первом доме, и им нужно пройти три дома до него. Жителям других
  // домов придется пройти меньшее расстояние до ближайшего магазина, поэтому ответ 3.
});
test('My', () => {
  assert.strictEqual(fn(['2 1 1 1']), 3);
});
