import { test, expect } from '@jest/globals';
import fn from './B.js';

test('1', () => {
  expect(fn(['2 0 1 1 0 1 0 2 1 2'])).toStrictEqual(3);

  // Примечания;
  // В примере из условия дальше всего идти до ближайшего магазина жителям четвертого дома: ближайший
  // к их дому магазин находится в первом доме, и им нужно пройти три дома до него. Жителям других
  // домов придется пройти меньшее расстояние до ближайшего магазина, поэтому ответ 3.
});
test('My', () => {
  expect(fn(['2 1 1 1'])).toStrictEqual(3);
});
